# Setup

In [1]:
library(tidyverse)
library(lubridate)
library(caret)

── Attaching core tidyverse packages ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
Loading required package: lattice


Attaching package: ‘caret’


The following object is masked from ‘package:purrr’:

    lift

In [2]:
df <- read.csv('data_raw/train.csv', na.strings=c("","NA"))

df %>% head
dim(df)

  X Name                              Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option  Pune       2015 41000
2 2 Honda Jazz V                      Chennai    2011 46000
3 3 Maruti Ertiga VDI                 Chennai    2012 87000
4 4 Audi A4 New 2.0 TDI Multitronic   Coimbatore 2013 40670
5 6 Nissan Micra Diesel XV            Jaipur     2013 86999
6 7 Toyota Innova Crysta 2.8 GX AT 8S Mumbai     2016 36000
  Fuel_Type Transmission Owner_Type Mileage    Engine  Power     Seats
1 Diesel    Manual       First      19.67 kmpl 1582 CC 126.2 bhp 5
2 Petrol    Manual       First      13 km/kg   1199 CC 88.7 bhp  5
3 Diesel    Manual       First      20.77 kmpl 1248 CC 88.76 bhp 7
4 Diesel    Automatic    Second     15.2 kmpl  1968 CC 140.8 bhp 5
5 Diesel    Manual       First      23.08 kmpl 1461 CC 63.1 bhp  5
6 Diesel    Automatic    First      11.36 kmpl 2755 CC 171.5 bhp 8
  New_Price Price
1 NA        12.50
2 8.61 Lakh  4.50
3 NA         6.00
4 NA        17.74
5 NA         3.50
6 21 Lakh   17.50

[1] 5847   14

## Handling Different Units (km/kg and km/L)

There's only 5 rows which have a Mileage in some unit other than kmpl. Hence, we can safely remove the associated rows, as they likely do not measure the same thing.

In [3]:
df[endsWith(df$Mileage, ("km/kg")),]

# filter out all rows that end with km/kg
df <- df %>% filter(!endsWith(df$Mileage, ("km/kg")))

     X  Name                   Location  Year Kilometers_Driven Fuel_Type
2     2 Honda Jazz V           Chennai   2011  46000            Petrol
25   26 Nissan Micra Diesel XV Hyderabad 2012  54000            Diesel
57   58 Nissan X-Trail SLX AT  Hyderabad 2010 121812            Diesel
NA   NA NA                     NA          NA     NA            NA
NA.1 NA NA                     NA          NA     NA            NA
     Transmission Owner_Type Mileage     Engine  Power     Seats New_Price
2    Manual       First      13 km/kg    1199 CC 88.7 bhp   5    8.61 Lakh
25   Manual       First      16.48 km/kg 1461 CC 63.1 bhp   5    NA
57   Automatic    First      9.49 km/kg  1995 CC 147.6 bhp  5    NA
NA   NA           NA         NA          NA      NA        NA    NA
NA.1 NA           NA         NA          NA      NA        NA    NA
     Price
2    4.50
25   4.25
57   7.75
NA     NA
NA.1   NA

# Part b: Removing Units

Now we can remove units from Mileage, Engine, Power, and New_Price

In [4]:
# mutate each column by replacing the unit with an empty string, then cast to numeric
df <- df %>% mutate(Mileage = Mileage %>% gsub("kmpl", "", .) %>% as.numeric)
df <- df %>% mutate(Power = Power %>% gsub("bhp", "", .) %>% as.numeric)
df <- df %>% mutate(Engine = Engine %>% gsub("CC", "", .) %>% as.numeric)
df <- df %>% mutate(New_Price = New_Price %>% gsub("Lakh", "", .) %>% as.numeric %>% suppressWarnings)

df %>% head

  X Name                                Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option    Pune       2015 41000
2 3 Maruti Ertiga VDI                   Chennai    2012 87000
3 4 Audi A4 New 2.0 TDI Multitronic     Coimbatore 2013 40670
4 6 Nissan Micra Diesel XV              Jaipur     2013 86999
5 7 Toyota Innova Crysta 2.8 GX AT 8S   Mumbai     2016 36000
6 8 Volkswagen Vento Diesel Comfortline Pune       2013 64430
  Fuel_Type Transmission Owner_Type Mileage Engine Power  Seats New_Price Price
1 Diesel    Manual       First      19.67   1582   126.20 5     NA        12.50
2 Diesel    Manual       First      20.77   1248    88.76 7     NA         6.00
3 Diesel    Automatic    Second     15.20   1968   140.80 5     NA        17.74
4 Diesel    Manual       First      23.08   1461    63.10 5     NA         3.50
5 Diesel    Automatic    First      11.36   2755   171.50 8     21        17.50
6 Diesel    Manual       First      20.54   1598   103.60 5     NA         5.20

In [5]:
write.csv(df, 'data_clean/00_removed_units.csv')

# Part a: Missing Values

First, we can find the amount of missing values in each column and the basic statistics of each. We can see that the only columns with missing values is Seats (38), Engine (36), Power (36), and New_Price (5,046)

In [6]:
# calculate the number of NA values for each feature
apply(df, 2, function(x) sum(is.na(x)))

summary(df)

                X              Name          Location              Year
                0                 0                 0                 0
Kilometers_Driven         Fuel_Type      Transmission        Owner_Type
                0                 0                 0                 0
          Mileage            Engine             Power             Seats
                0                36                36                38
        New_Price             Price
             5046                 0

       X            Name             Location              Year
 Min.   :   1   Length:5842        Length:5842        Min.   :1998
 1st Qu.:1511   Class :character   Class :character   1st Qu.:2012
 Median :3016   Mode  :character   Mode  :character   Median :2014
 Mean   :3014                                         Mean   :2013
 3rd Qu.:4518                                         3rd Qu.:2016
 Max.   :6018                                         Max.   :2019

 Kilometers_Driven  Fuel_Type         Transmission        Owner_Type
 Min.   :    171   Length:5842        Length:5842        Length:5842
 1st Qu.:  33431   Class :character   Class :character   Class :character
 Median :  52588   Mode  :character   Mode  :character   Mode  :character
 Mean   :  58406
 3rd Qu.:  72493
 Max.   :6500000

    Mileage          Engine         Power           Seats
 Min.   : 0.00   Min.   : 624   Min.   : 34.2   Min.   : 2.000
 1st Qu.:15.26   1st Qu.:1198   1st Qu.: 78.0   1st Qu.: 5.000
 Median :18.19   Median :1497   Median : 98.6   Median : 5.000
 Mean   :18.16   Mean   :1632   Mean   :113.8   Mean   : 5.287
 3rd Qu.:21.10   3rd Qu.:1991   3rd Qu.:139.0   3rd Qu.: 5.000
 Max.   :28.40   Max.   :5998   Max.   :560.0   Max.   :10.000
                 NA's   :36     NA's   :36      NA's   :38
   New_Price          Price
 Min.   : 3.910   Min.   :  0.440
 1st Qu.: 8.018   1st Qu.:  3.550
 Median :11.665   Median :  5.750
 Mean   :20.917   Mean   :  9.655
 3rd Qu.:25.302   3rd Qu.: 10.250
 Max.   :99.920   Max.   :160.000
 NA's   :5046

## Impute or Drop

Starting off by looking at the New_Price column, it is obvious that our only option is to impute the data, as removing 5,046 rows from the dataset would be undesired. I'll impute this column by mean.

In [7]:
df$New_Price[is.na(df$New_Price)] <- mean(df$New_Price, na.rm = TRUE)

summary(df$New_Price)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
   3.91   20.92   20.92   20.92   20.92   99.92

Next, let's take a look at the remaining 3 features. We can see that there is a large amount of overlap between the missing values for Engine, Power and Seats (in fact, there is 100% overlap between the NA rows). Additionally, we can see that the New_Price feature for each is not unique, rather, it is the value of the mean that was used in the previous impute step; hence, the values of the New_Price column do not provide any additional variance.

Additionally, we can see that these rows make up only ~0.65% of the dataset.

In [8]:
df[!complete.cases(df),]

cat(sprintf("TOTAL PERCENT OF DATAFRAME: %s", (nrow(df[!complete.cases(df),])) / (nrow(df)) * 100))

     X    Name                                         Location   Year
184   194 Honda City 1.5 GXI                           Ahmedabad  2007
198   208 Maruti Swift 1.3 VXi                         Kolkata    2010
218   229 Ford Figo Diesel                             Bangalore  2015
707   733 Maruti Swift 1.3 VXi                         Chennai    2006
721   749 Land Rover Range Rover 3.0 D                 Mumbai     2008
1251 1294 Honda City 1.3 DX                            Delhi      2009
1282 1327 Maruti Swift 1.3 ZXI                         Hyderabad  2015
1337 1385 Honda City 1.5 GXI                           Pune       2004
1410 1460 Land Rover Range Rover Sport 2005 2012 Sport Coimbatore 2008
1858 1917 Honda City 1.5 EXI                           Jaipur     2005
2012 2074 Maruti Swift 1.3 LXI                         Pune       2011
2034 2096 Hyundai Santro LP zipPlus                    Coimbatore 2004
2197 2264 Toyota Etios Liva V                          Pune       2012
2254 2325 Maruti Swift 1.3 VXI ABS                     Pune       2015
2264 2335 Maruti Swift 1.3 VXi                         Mumbai     2007
2445 2530 BMW 5 Series 520d Sedan                      Kochi      2014
2457 2542 Hyundai Santro GLS II - Euro II              Bangalore  2011
2536 2623 BMW 5 Series 520d Sedan                      Pune       2012
2578 2668 Maruti Swift 1.3 VXi                         Kolkata    2014
2646 2737 Maruti Wagon R Vx                            Jaipur     2001
2689 2780 Hyundai Santro GLS II - Euro II              Pune       2009
2751 2842 Hyundai Santro GLS II - Euro II              Bangalore  2012
3168 3272 BMW 5 Series 520d Sedan                      Mumbai     2008
3298 3404 Maruti Swift 1.3 VXi                         Jaipur     2006
3410 3520 BMW 5 Series 520d Sedan                      Delhi      2012
3412 3522 Hyundai Santro GLS II - Euro II              Kochi      2012
3688 3810 Honda CR-V AT With Sun Roof                  Kolkata    2013
3883 4011 Fiat Punto 1.3 Emotion                       Pune       2011
4020 4152 Land Rover Range Rover 3.0 D                 Mumbai     2003
4097 4229 Hyundai Santro Xing XG                       Bangalore  2005
4441 4577 BMW 5 Series 520d Sedan                      Delhi      2012
4467 4604 Honda Jazz Select Edition                    Pune       2011
4559 4697 Fiat Punto 1.2 Dynamic                       Kochi      2017
4573 4712 Hyundai Santro Xing XG                       Pune       2003
4805 4952 Fiat Punto 1.4 Emotion                       Kolkata    2010
4866 5015 Maruti Swift 1.3 VXi                         Delhi      2006
5033 5185 Maruti Swift 1.3 LXI                         Delhi      2012
5117 5270 Honda City 1.5 GXI                           Bangalore  2002
     Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage Engine
184   60006            Petrol    Manual       First           0.00     NA
198   42001            Petrol    Manual       First          16.10     NA
218   70436            Diesel    Manual       First           0.00   1498
707   97800            Petrol    Manual       Third          16.10     NA
721   55001            Diesel    Automatic    Second          0.00     NA
1251  55005            Petrol    Manual       First          12.80     NA
1282  50295            Petrol    Manual       First          16.10     NA
1337 115000            Petrol    Manual       Second          0.00     NA
1410  69078            Petrol    Manual       First           0.00     NA
1858  88000            Petrol    Manual       Second         13.00   1493
2012  24255            Petrol    Manual       First          16.10     NA
2034  52146            Petrol    Manual       First           0.00     NA
2197  24500            Petrol    Manual       Second         18.30     NA
2254  67000            Petrol    Manual       First          16.10     NA
2264  55000            Petrol    Manual       Second         16.10     NA
2445  64158            Diesel    Automatic    First          18.48     NA
2457  65000            Petrol    Manual       Second          0.00     NA
2536  95000            Diesel    Automatic    Second         18.48     NA
2578  32986            Petrol    Manual       First          16.10     NA
2646 200000            Petrol    Manual       First          12.00     NA
2689 100000            Petrol    Manual       First           0.00     NA
2751  43000            Petrol    Manual       First           0.00     NA
3168  81000            Diesel    Automatic    Second         18.48     NA
3298 125000            Petrol    Manual       Fourth & Above 16.10     NA
3410  90000            Diesel    Automatic    First          18.48     NA
3412  66400            Petrol    Manual       First           0.00     NA
3688  27000            Petrol    Automatic    First          14.00     NA
3883  45271            Diesel    Manual       First          20.30     NA
4020  75000            Diesel    Automatic    Second          0.00     NA
4097  79000            Petrol    Manual       Second         17.00     NA
4441  72000            Diesel    Automatic    Third          18.48     NA
4467  98000            Petrol    Manual       First          16.70     NA
4559  17941            Petrol    Manual       First          15.70     NA
4573  80000            Petrol    Manual       Second         17.00     NA
4805  47000            Petrol    Manual       First          14.60     NA
4866  63000            Petrol    Manual       First          16.10     NA
5033  52000            Petrol    Manual       First          16.10     NA
5117  53000            Petrol    Manual       Second          0.00     NA
     Power Seats New_Price Price
184   NA   NA    20.91683   2.95
198   NA   NA    20.91683   2.11
218   99   NA    20.91683   3.60
707   NA   NA    20.91683   1.75
721   NA   NA    20.91683  26.50
1251  NA   NA    20.91683   3.20
1282  NA   NA    20.91683   5.80
1337  NA   NA    20.91683   1.50
1410  NA   NA    20.91683  40.88
1858 100   NA    20.91683   1.70
2012  NA   NA    20.91683   3.15
2034  NA   NA    20.91683   1.93
2197  NA   NA    20.91683   2.95
2254  NA   NA    20.91683   4.70
2264  NA   NA    20.91683   1.75
2445  NA   NA    20.91683  17.89
2457  NA   NA    20.91683   3.15
2536  NA   NA    20.91683  18.00
2578  NA   NA    20.91683   4.24
2646  NA   NA    20.91683   0.70
2689  NA   NA    20.91683   1.60
2751  NA   NA    20.91683   3.25
3168  NA   NA    20.91683  10.50
3298  NA   NA    20.91683   2.35
3410  NA   NA    20.91683  14.50
3412  NA   NA    20.91683   2.66
3688  NA   NA    20.91683  11.99
3883  NA   NA    20.91683   2.60
4020  NA   NA    20.91683  16.11
4097  NA   NA    20.91683   1.65
4441  NA   NA    20.91683  13.85
4467  NA   NA    20.91683   3.15
4559  NA   NA    20.91683   3.93
4573  NA   NA    20.91683   0.90
4805  NA   NA    20.91683   1.49
4866  NA   NA    20.91683   1.60
5033  NA   NA    20.91683   3.65
5117  NA   NA    20.91683   1.85

TOTAL PERCENT OF DATAFRAME: 0.650462170489558

As a result of being a low percentage of the overall dataset, and contributing little variance to several of the features, I'll just remove these rows.

In [9]:
df <- df[complete.cases(df),]

apply(df, 2, function(x) sum(is.na(x)))

                X              Name          Location              Year
                0                 0                 0                 0
Kilometers_Driven         Fuel_Type      Transmission        Owner_Type
                0                 0                 0                 0
          Mileage            Engine             Power             Seats
                0                 0                 0                 0
        New_Price             Price
                0                 0

In [10]:
write.csv(df, 'data_clean/01_removed_na.csv')

# Part c: One-Hot Encoding

Both Fuel_Type and Transmission are categorical variables that have two unique values. In order to one-hot encode these features, 4 new columns will be made: Fuel_TypeDiesel, Fuel_TypePetrol, TransmissionAutomatic, and TransmissionManual. Each row in these columns will contain either 1 for presence of that feature, or 0 for absence. The caret library was used for this section.

In [11]:
unique(df$Fuel_Type)
unique(df$Transmission)

# create dummy vars (split features and assign values of 0 or 1)
dummy <- dummyVars(~ Fuel_Type + Transmission, data=df)
df_new <- data.frame(predict(dummy, newdata=df))

df <- df %>% select(-6:-7) %>% cbind(df_new)
df %>% head

[1] "Diesel" "Petrol"

[1] "Manual"    "Automatic"

  X Name                                Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option    Pune       2015 41000
2 3 Maruti Ertiga VDI                   Chennai    2012 87000
3 4 Audi A4 New 2.0 TDI Multitronic     Coimbatore 2013 40670
4 6 Nissan Micra Diesel XV              Jaipur     2013 86999
5 7 Toyota Innova Crysta 2.8 GX AT 8S   Mumbai     2016 36000
6 8 Volkswagen Vento Diesel Comfortline Pune       2013 64430
  Owner_Type Mileage Engine Power  Seats New_Price Price Fuel_TypeDiesel
1 First      19.67   1582   126.20 5     20.91683  12.50 1
2 First      20.77   1248    88.76 7     20.91683   6.00 1
3 Second     15.20   1968   140.80 5     20.91683  17.74 1
4 First      23.08   1461    63.10 5     20.91683   3.50 1
5 First      11.36   2755   171.50 8     21.00000  17.50 1
6 First      20.54   1598   103.60 5     20.91683   5.20 1
  Fuel_TypePetrol TransmissionAutomatic TransmissionManual
1 0               0                     1
2 0               0                     1
3 0               1                     0
4 0               0                     1
5 0               1                     0
6 0               0                     1

In [12]:
write.csv(df, 'data_clean/02_one_hot.csv')

# Part d: Adding Features

In this section, two new columns will be added which describes the age of the car, and the average value loss per year.

In [13]:
df <- df %>%
    mutate(Age = (2024 - Year)) %>%
    mutate(Annual_Value_Loss = ifelse(Age == 0, NA, (New_Price - Price) / Age))

df %>% head

  X Name                                Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option    Pune       2015 41000
2 3 Maruti Ertiga VDI                   Chennai    2012 87000
3 4 Audi A4 New 2.0 TDI Multitronic     Coimbatore 2013 40670
4 6 Nissan Micra Diesel XV              Jaipur     2013 86999
5 7 Toyota Innova Crysta 2.8 GX AT 8S   Mumbai     2016 36000
6 8 Volkswagen Vento Diesel Comfortline Pune       2013 64430
  Owner_Type Mileage Engine Power  Seats New_Price Price Fuel_TypeDiesel
1 First      19.67   1582   126.20 5     20.91683  12.50 1
2 First      20.77   1248    88.76 7     20.91683   6.00 1
3 Second     15.20   1968   140.80 5     20.91683  17.74 1
4 First      23.08   1461    63.10 5     20.91683   3.50 1
5 First      11.36   2755   171.50 8     21.00000  17.50 1
6 First      20.54   1598   103.60 5     20.91683   5.20 1
  Fuel_TypePetrol TransmissionAutomatic TransmissionManual Age
1 0               0                     1                   9
2 0               0                     1                  12
3 0               1                     0                  11
4 0               0                     1                  11
5 0               1                     0                   8
6 0               0                     1                  11
  Annual_Value_Loss
1 0.9352038
2 1.2430695
3 0.2888031
4 1.5833486
5 0.4375000
6 1.4288031

In [14]:
write.csv(df, 'data_clean/03_added_features.csv')

# Part e: Common Operations

Here, the following functions will be used:
- select
- filter
- rename
- mutate
- arrange
- summarize
- group_by

## select

This will show the rows for the Engine and Power columns.

In [15]:
df %>% select(c('Engine', 'Power')) %>% head

  Engine Power
1 1582   126.20
2 1248    88.76
3 1968   140.80
4 1461    63.10
5 2755   171.50
6 1598   103.60

## filter

This shows all cars that are made after 2015 and have less than 40,000 kilometers driven.

In [16]:
df %>% filter(Year >= 2015 & Kilometers_Driven < 40000) %>% head

  X  Name                                      Location   Year
1  7 Toyota Innova Crysta 2.8 GX AT 8S         Mumbai     2016
2 10 Maruti Ciaz Zeta                          Kochi      2018
3 17 Maruti Swift DDiS VDI                     Jaipur     2017
4 28 Honda WRV i-VTEC VX                       Kochi      2018
5 42 Mahindra KUV 100 mFALCON D75 K8 Dual Tone Coimbatore 2017
6 50 Audi A4 2.0 TDI 177 Bhp Premium Plus      Kochi      2015
  Kilometers_Driven Owner_Type Mileage Engine Power  Seats New_Price Price
1 36000             First      11.36   2755   171.50 8     21.00000  17.50
2 25692             First      21.56   1462   103.25 5     10.65000   9.95
3 25000             First      28.40   1248    74.00 5     20.91683   5.99
4 37430             First      17.50   1199    88.70 5     10.57000   9.90
5 22033             First      25.32   1198    77.00 6     20.91683   5.58
6 13648             First      17.11   1968   174.33 5     20.91683  21.43
  Fuel_TypeDiesel Fuel_TypePetrol TransmissionAutomatic TransmissionManual Age
1 1               0               1                     0                  8
2 0               1               0                     1                  6
3 1               0               0                     1                  7
4 0               1               0                     1                  6
5 1               0               0                     1                  7
6 1               0               1                     0                  9
  Annual_Value_Loss
1  0.43750000
2  0.11666667
3  2.13240488
4  0.11166667
5  2.19097631
6 -0.05701843

## rename

Here, we'll rename the Fuel_Type and Transmission one-hot encoded features created earlier by adding an underscore before the classification.

In [17]:
lookup <- c(Fuel_Type_Diesel = "Fuel_TypeDiesel",
            Fuel_Type_Petrol = "Fuel_TypePetrol",
            Transmission_Automatic = "TransmissionAutomatic",
            Transmission_Manual = "TransmissionManual")

df %>% rename(all_of(lookup)) %>% head

  X Name                                Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option    Pune       2015 41000
2 3 Maruti Ertiga VDI                   Chennai    2012 87000
3 4 Audi A4 New 2.0 TDI Multitronic     Coimbatore 2013 40670
4 6 Nissan Micra Diesel XV              Jaipur     2013 86999
5 7 Toyota Innova Crysta 2.8 GX AT 8S   Mumbai     2016 36000
6 8 Volkswagen Vento Diesel Comfortline Pune       2013 64430
  Owner_Type Mileage Engine Power  Seats New_Price Price Fuel_Type_Diesel
1 First      19.67   1582   126.20 5     20.91683  12.50 1
2 First      20.77   1248    88.76 7     20.91683   6.00 1
3 Second     15.20   1968   140.80 5     20.91683  17.74 1
4 First      23.08   1461    63.10 5     20.91683   3.50 1
5 First      11.36   2755   171.50 8     21.00000  17.50 1
6 First      20.54   1598   103.60 5     20.91683   5.20 1
  Fuel_Type_Petrol Transmission_Automatic Transmission_Manual Age
1 0                0                      1                    9
2 0                0                      1                   12
3 0                1                      0                   11
4 0                0                      1                   11
5 0                1                      0                    8
6 0                0                      1                   11
  Annual_Value_Loss
1 0.9352038
2 1.2430695
3 0.2888031
4 1.5833486
5 0.4375000
6 1.4288031

## mutate

This section adds a new feature Miles_Driven, based on the Kilometers_Driven feature times a conversion factor.

In [18]:
df %>% mutate(Miles_Driven = Kilometers_Driven * 0.6213711922) %>% head

  X Name                                Location   Year Kilometers_Driven
1 1 Hyundai Creta 1.6 CRDi SX Option    Pune       2015 41000
2 3 Maruti Ertiga VDI                   Chennai    2012 87000
3 4 Audi A4 New 2.0 TDI Multitronic     Coimbatore 2013 40670
4 6 Nissan Micra Diesel XV              Jaipur     2013 86999
5 7 Toyota Innova Crysta 2.8 GX AT 8S   Mumbai     2016 36000
6 8 Volkswagen Vento Diesel Comfortline Pune       2013 64430
  Owner_Type Mileage Engine Power  Seats New_Price Price Fuel_TypeDiesel
1 First      19.67   1582   126.20 5     20.91683  12.50 1
2 First      20.77   1248    88.76 7     20.91683   6.00 1
3 Second     15.20   1968   140.80 5     20.91683  17.74 1
4 First      23.08   1461    63.10 5     20.91683   3.50 1
5 First      11.36   2755   171.50 8     21.00000  17.50 1
6 First      20.54   1598   103.60 5     20.91683   5.20 1
  Fuel_TypePetrol TransmissionAutomatic TransmissionManual Age
1 0               0                     1                   9
2 0               0                     1                  12
3 0               1                     0                  11
4 0               0                     1                  11
5 0               1                     0                   8
6 0               0                     1                  11
  Annual_Value_Loss Miles_Driven
1 0.9352038         25476.22
2 1.2430695         54059.29
3 0.2888031         25271.17
4 1.5833486         54058.67
5 0.4375000         22369.36
6 1.4288031         40034.95

## arrange

Here, we arrange the rows such that Price is sorted in ascending order (lowest prices first), and in case of a tie in the Price, Year will be used in descending order (newest cars first).

In [19]:
df %>% arrange(Price, desc(Year)) %>% head

  X    Name                 Location Year Kilometers_Driven Owner_Type Mileage
1 1713 Tata Nano Lx         Pune     2011 65000             Second     26.0
2 2847 Hyundai Getz GLS     Pune     2005 86000             Second     15.3
3 1628 Maruti 800 Std BSIII Jaipur   2004 12000             Second     16.1
4 3138 Maruti Zen LXI       Jaipur   1998 95150             Third      17.3
5 2605 Tata Nano Cx         Jaipur   2010 57000             First      26.0
6 3228 Maruti 800 Std       Pune     2003 52000             First      16.1
  Engine Power Seats New_Price Price Fuel_TypeDiesel Fuel_TypePetrol
1  624   35    4     20.91683  0.44  0               1
2 1341   83    5     20.91683  0.45  0               1
3  796   37    4     20.91683  0.45  0               1
4  993   60    5     20.91683  0.45  0               1
5  624   35    4     20.91683  0.50  0               1
6  796   37    4     20.91683  0.50  0               1
  TransmissionAutomatic TransmissionManual Age Annual_Value_Loss
1 0                     1                  13  1.5751411
2 0                     1                  19  1.0772018
3 0                     1                  20  1.0233417
4 0                     1                  26  0.7871859
5 0                     1                  14  1.4583453
6 0                     1                  21  0.9722302

## summarize

This will summarize the data based on Location to show the number of rows, average price, median age, and number of diesel vehicles per location.

In [20]:
df %>%
    group_by(Location) %>%
    summarize(
        N = n(),
        Average_Price = mean(Price),
        Median_Age = median(Age),
        Num_Diesel = sum(Fuel_TypeDiesel)
    )

   Location   N   Average_Price Median_Age Num_Diesel
1  Ahmedabad  217  8.593134     10         137
2  Bangalore  347 13.638040     11         213
3  Chennai    473  7.968118     12         285
4  Coimbatore 629 15.140350      8         353
5  Delhi      535  9.905514     10         301
6  Hyderabad  707 10.014668     11         495
7  Jaipur     400  5.949225     11         227
8  Kochi      637 11.323940      8         303
9  Kolkata    521  5.739885     11         252
10 Mumbai     757  9.566592     10         306
11 Pune       581  6.992324     11         278